{
  "name": "Aditya Sugandhi",
  "content": "🚀 Welcome to the Digital Realm of Aditya Sugandhi: Crafting Tomorrow's Innovations 🚀\n\nUnlock the Gateway to Excellence with Aditya Sugandhi\n\nEmbark on a journey through the digital cosmos with Aditya Sugandhi, a visionary software engineer dedicated to shaping the future of technology. Navigate the intricate web of creativity, expertise, and innovation as you explore the stellar portfolio of a coding virtuoso.",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Aditya",
  "headerTaglineThree": ["Software Engineer", "Data Scientist", "Researcher","Product Designer"],
  "headerTaglineFour": "",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/adityasugandhi"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/sugandhiaditya/"
    },
    {
      "id": "3",
      "title": "Twitter",
      "link": "https://twitter.com/stranzersweb"
    },
    {
      "id": "4",
      "title": "Email",
      "link": "mailto:as22cq@fsu.edu"
    }
  ],
  "projects": [

    {
      "id": "1",
      "title": "Network Simulation",
      "description": "Architecting Connectivity: Orchestrating the Integration of Network Layers for Seamless Data Transmission",
      "imageSrc": "/projects/Networks.jpeg",
      "url": "https://github.com/adityasugandhi/Network-Simulation",
      "Docs": "/Docs/Networking Wonderland.pdf"
    },
    {
      "id": "da5846b2-2868-404f-82fe-b26c9a34fc68",
      "title": "Improved Algorithms in finding maximal & maximum clique in uncertain networks",
      "description": "Implemented Maximal Clique Algorithm for finding maximal & non-maximal clique in uncertain networks, datasets based on Social networks. such as LinkedIn, Facebook, Ask Ubuntu",
      "imageSrc": "/projects/earth.jpeg",
      "url": "https://github.com/adityasugandhi/Improved-Algorithms-in-finding-maximal-and-maximum-clique-in-uncertain-networks",
      "Docs": "/Docs/FINAL_PROJECT_REPORT_DBS.pdf"
      
    },
    {
      "id": "3",
      "title": "Transforming Minds: Decoding the Magic of Transformer Architecture",
      "description": "Unlock the mysteries of Transformer architecture in my latest YouTube video! 🚀📚 Join me for a captivating journey into the heart of modern language models. 🔍✨ #TransformerMagic #AIExplained",
      "imageSrc": "/projects/earth.jpeg",
      "url": "https://www.youtube.com/watch?v=I7_KOtXMmw4",
      "youtubeId":"I7_KOtXMmw4"

    },
    {
      "id": "4",
      "title": "Maglab - A Magnetic Field Simulation Data Analysis",
      "description": "Unraveling the enigma of an oil sample through cutting-edge mass spectrometry. Deciphered the molecular formulas of the top five abundant compounds, igniting a quest to unveil their true identities. A testament to my passion for unlocking nature's secrets, one spectrum at a time.",
      "imageSrc": "/projects/maglab_at_night.jpeg",
      "url": "https://www.youtube.com/watch?v=I7_KOtXMmw4",
      "Docs": "/Docs/Project2_ProDS.pdf"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Web Design and Development",
      "description": "🌐 Dive into the digital realm with our Web Design and Development magic! ✨ We specialize in crafting visually stunning websites that captivate and convert. 💻 From concept to launch, we turn your online dreams into reality. 🎨 Let's create a web presence that stands out in the vast digital landscape. Ready for a journey of design brilliance? Let's build it together! 🚀 #WebMasters #DigitalDreams"
    },
    {
      "id": "2",
      "title": "Software Architecture Design",
      "description": "🚀 Supercharge your software's DNA with our visionary Software Architectural Design! Tailored for success, we craft scalable solutions, ensuring a resilient foundation for your business. 🌐 Unleash unparalleled performance, streamline development, and future-proof your tech with our expertise. Elevate your software journey – where innovation meets excellence! 🌟 #TechTransformation"
    },
    {
      "id": "3",
      "title": "Data Analysis Design",
      "description": "Empower your business with our Data Analytics Services. We turn raw data into actionable insights, providing a competitive advantage. From data visualization to predictive modeling, our tailored solutions optimize decision-making and enhance overall performance. Elevate your strategy with impactful data-driven decisions."
    },
    {
      "id": "4",
      "title": "Personalized LLM Modelling",
      "description": "Revolutionize your AI solutions with our Personalized Language Models (LLM). Tailored to your unique needs, we deliver precision and relevance in language processing. From fine-tuning to bespoke models, elevate your applications with our cutting-edge Personalized LLM services for optimal performance."
    }
  ],
  "aboutpara": "Hey there! Aditya here, a rockstar ‍ Software Engineer with 3+ years of building squeaky clean, super scalable code. ️✨\n\nCurrently chilling in sunny Tallahassee, FL ☀️, working as a Research Assistant at the Department of Scientific Computing (FSU). We're on a mission to predict monsoon forecasts for the Florida region using some seriously cool tech: Graph CNNs and 3D CNNs. Think analyzing a hundred years worth of data (1923-2023) from the whole world to predict monsoon season like a boss! ⛈️\n\nIt's not just a job, it's an adventure! #GNN's #WeatherModeling #large-scale data analysis #MonsoonMagic #FSU ⚡️",
  "resume": {
    "tagline": "👋 I'm a software engineer, product designer.",
    "description": "Software Engineer with 3+ years of industry experience, specializing in designing & developing scalable software solutions. Proficient in a wide range of programming languages & technologies. Seeking a challenging role to leverage technical expertise.",
    "experiences": [
      {
        "id": "1",
        "dates": "Jan 2023 - Present",
        "type": "Part-time",
        "position": "Research Assistant at Department of Scientific Computing (FSU)",
        "bullets": [
          "Conducted in-depth analysis of a century’s (1923-2023) worth of data for Monsoon Forecast Prediction, encompassing variables such as (Salinity Surface Temperature and Surface-to-Air Temperature.",
          "Reprogrammed the Earth Oceanic Atmospheric Science (EOAS)/pyutils library by implementing a dynamic programming approach reducing complexity from Exponential to Linear time, Expedited data simulation and processing for various machine learning models utilized by peer researchers. Streamlined data processing on the server resulted in a significant 30% reduction in overall training time"
        ]
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "July 2020 - March 2022",
        "type": "Full Time",
        "position": "Software Engineer at Aspire Sytems",
        "bullets": [
          "Revamped a service-oriented architecture for a 40% surge in online appointments and customer engagement at a leading UK-based Life Insurance Company. Employed Kafka Redis and NoSQL databases for efficient data processing.",
          "Engineered 20 RESTful APIs (HATEOAS) for responsive patient data management and flexible interfaces. Collaborated on front-end enhancements driving a 25% increase in user interaction.",
          "Implemented secure payment gateways (Stripe PayPal) and robust Single Sign-On (SSO) for authentication.",
          "Transformed issue resolution: strategic debugging Splunk for real-time logs and swift CI/CD with Jenkins halving resolution time.",
          "Deployed Spring Boot applications on AWS Elastic Beanstalk optimizing patient data management & ensuring system performance.",
          "Addressed varied client needs in occupational health ensuring compliance and security while crafting a robust solution with custom analytic modules for tailored insights by tapping into Kafka-streams.",
          "Unleashed real-time insights via dynamic dashboards elevating stakeholder empowerment. Transformed insurance dynamics fortifying medical life and pet coverage with robust security. Spearheaded financial excellence with seamless Oracle integration surpassing security standards.",
          "Automated system refreshes through CI/CD pipelines for up-to-date technology & security standards."
        ]
      },
      {
        "id": "9fbbf2e4-2d48-4576-8c18-ccd4a2a453d4",
        "dates": "May 2019 - Oct 2019",
        "type": "Internship",
        "position": "Web Developer at Impetus",
        "bullets": [
          "\"Innovated a PHP-centric design using the Laravel framework to enhance user interface interaction on a client co-work website.",
          "Managed diverse CMS systems (Joomla WordPress Drupal) ensuring flexible procedures & guiding seamless content delivery. Successfully migrated Joomla versions showcasing proficiency problem-solving & policy adherence.",
          "Automated workflows with SharePoint reducing operational overhead by 45% & optimizing procedures for efficient collaboration.",
          "Optimized backend database management with PHP & Joomla ensuring efficient processes enhancing responsiveness & aligning with company policies.\""
        ]
      }
    ],
    "education": [
      {
        "universityName": "Florida State University",
        "universityDate": "2022-2024",
        "universityPara": "Master's of Science in Computer Science"
      },
      {
        "universityName": "SRM University",
        "universityDate": "2016-2020",
        "universityPara": "Bachelor's of Technology in Computer Science"
      }
    ],
    "languages": [
      "Javascript",
      "HTML5",
      "CSS",
      "Python",
      "Go",
      "PHP",
      "Java",
      "C++",
      "C#",
      "R"
    ],
    "frameworks": [
      "React",
      "Typescript",
      "NodeJs",
      "Spring Boot",
      "Laravel",
      "MVC",
      "MVVM"
    ],
    "others": [
      "Figma",
      "AdobeXD",
      "AWS",
      "Data Analysis",
      "GIS"
    ]
  }
}
